Repository: EkaterinePapava/icoutils
Catalog: po/*.po
Languages: ka

source: Unknown system error
ka: სისტემის უცნობი შეცდომა

source: %s: option '%s%s' is ambiguous
ka: %s: პარამეტრი '%s%s' გაურკვეველია

source: %s: option '%s%s' is ambiguous; possibilities:
ka: %s: პარამეტრი '%s%s' გაურკვეველია; შესაძლო ვარიანტები:

source: %s: unrecognized option '%s%s'
ka: %s: უცნობი პარამეტრი '%s'%s'

source: %s: option '%s%s' doesn't allow an argument
ka: %s: პარამეტრი '%s%s' არგუმენტებს არ იღებს

source: %s: option '%s%s' requires an argument
ka: %s: პარამეტრი '%s%s' არგუმენტს საჭიროებს.

source: %s: invalid option -- '%c'
ka: %s: არასწორი პარამეტრი -- '%c'

source: %s: option requires an argument -- '%c'
ka: %s: პარამეტრს ესაჭიროება არგუმენტი -- '%c'

source: Packaged by %s (%s)
ka: აწყობილია %s-ის მიერ (%s)

source: Packaged by %s
ka: აწყობილია %s-ის მიერ

source: Written by %s.
ka: ავტორი: %s.

source: Written by %s and %s.
ka: ავტორები: %s და %s.

source: Written by %s, %s, and %s.
ka: ავტორები: %s, %s და %s.

source: Written by %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s და %s.

source: Written by %s, %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s, %s და %s.

source: Written by %s, %s, %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s, %s, %s და %s.

source: Written by %s, %s, %s, %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s, %s, %s, %s და %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s, %s, %s, %s, %s და %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, and %s.
ka: ავტორები: %s, %s, %s, %s, %s, %s, %s %s და %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, %s, and others.
ka: ავტორები: %s, %s, %s, %s, %s, %s, %s %s, %s და სხვ.

source: Report bugs to: %s
ka: შეცდომები გაუგზავნეთ: %s

source: Report %s bugs to: %s
ka: %s-ის შეცდომების შესახებ მისაწერი ელფოსტა: %s

source: %s home page: <%s>
ka: %s-ის საწყისი გვერდია: <%s>

source: General help using GNU software: <%s>
ka: GNU-ის პროგრამული უზრუნველყოფის საერთო დახმარება: <%s >

source: memory exhausted
ka: მეხსიერება გადავსებულია

source: An internal error has occured. Please report this error by sending the output below to %s. Program: %s Version: %s Error:
ka: აღმოჩენილია შიდა შეცდომა. მოგვწერეთ ამ შეცდომის შესახებ ქვემოთ მოყვანილი ინფორმაციის გამოგზავნით მისამართზე %s. პროგრამა: %s ვერსია: %s შეცდომა:

source: Called iterator_remove before first iterator_next
ka: iterator_remove გამოძახებულია პირველ iterator_next-მდე

source: cannot read file
ka: ფაილის წაკითხვის შეცდომა

source: premature end
ka: მოულოდნელი ბოლო

source: cannot open file
ka: ფაილი ვერ გავხსენი

source: not a png file
ka: png ფაილი არაა

source: cannot initialize PNG library
ka: PNG-ის ბიბლიოთეკის ინიციალიზაცია შეუძლებელია

source: cannot create PNG info structure - out of memory
ka: PNG-ის ინფორმაციის სტრუქტურის შექმნა შეუძლებელია - არასაკმარისი მეხსიერება

source: cannot decrease bit depth from %d to %d, bit depth not changed
ka: ბიტური სიღრმის %d-დან %d-ზე გაზრდა შეუძლებელია. ბიტური სიღრმე არ შეცვლილა

source: cannot create file
ka: ფაილის შექმნის შეცდომა

source: cannot write to file
ka: ფაილში ჩაწერის შეცდომა

source: read error
ka: წაკითხვის შეცდომა

source: not an icon or cursor file (reserved non-zero)
ka: არ წარმოადგენს ხატულას, ან კურსორის ფაილს (დაცული არანულოვანია)

source: not an icon or cursor file (wrong type)
ka: არ წარმოადგენს ხატულას, ან კურსორის ფაილს (არასწორი ტიპი)

source: reserved is not zero
ka: დაცული ნული არაა

source: PNG too large
ka: PNG ფაილი მეტისმეტად დიდია

source: bitmap header is too short
ka: რასტრული გამოსახულების თავსართი მეტისმეტად მოკლეა

source: compressed image data not supported
ka: შეკუმშული გამოსახულების მონაცემები მხარდაჭერილი არაა

source: x_pels_per_meter field in bitmap should be zero
ka: x_pels_per_meter ველი რასტრულ გამოსახულებაში ნულის ტოლი უნდა იყოს

source: y_pels_per_meter field in bitmap should be zero
ka: y_pels_per_meter ველი რასტრულ გამოსახულებაში ნულის ტოლი უნდა იყოს

source: clr_important field in bitmap should be zero
ka: clr_important ველი რასტრულ გამოსახულებაში ნულის ტოლი უნდა იყოს

source: planes field in bitmap should be one
ka: planes ველი რასტრულ გამოსახულებაში ნულის ტოლი უნდა იყოს

source: skipping %d bytes of extended bitmap header
ka: გაფართოებული რასტრული გამოსახულების თავსართის %d ბაიტის გამოტოვება

source: palette too large
ka: პალიტრა მეტისმეტად დიდია

source: invalid bitmap width
ka: არასწორი რასტრული გამოსახულების სიგანე

source: bitmap width too large
ka: რასტრული გამოსახულების სიგანე მეტისმეტად დიდაი

source: incorrect total size of bitmap (%d specified; %d real)
ka: რასტრული გამოსახულების არასწორი ჯამური ზომა (მითითებული %d. რეალური %d)

source: offset of bitmap header incorrect (too low)
ka: რასტრული გამოსახულების თავსართის წანაცვლება არასწორია (მეტისმეტად დაბალია)

source: invalid data at expected offset (unrecoverable)
ka: არასწორი მონაცემები მოსალოდნელ წანაცვლებასთან (აღუდგენელია)

source: skipping %u bytes of garbage at %u
ka: %u ბაიტი ნაგვის გამოტოვება მისამართზე %u

source: refusing to write binary data to terminal
ka: ბინარული მონაცემები ტერმინალზე გამოტანილი არ იქნება

source: (standard out)
ka: (სტანდარტული გამოტანა)

source: Usage: %s [OPTION]... [FILE]...
ka: გამოყენება: %s [პარამეტრი].. [ფაილი]...

source: Convert and create Win32 icon (.ico) and cursor (.cur) files.
ka: Win32-ის ხატულას (.ico) და კურსორის (.cur) ფაილების შექმნა და გადაყვანა.

source: Commands:
ka: ბრძანებები:

source: -x, --extract extract images from files
ka: -x, --extract გამოსახულებების ამოღება ფაილებიდან

source: -l, --list print a list of images in files
ka: -l, --list გამოსახულებების სიის გამოტანა ფაილებიდან

source: -c, --create create an icon file from specified files
ka: -c, --create ხატულას ფაილის შექმნა მითითებული ფაილებიდან

source: --help display this help and exit
ka: --help ამ დახმარების გამოტანა და გასვლა

source: --version output version information and exit
ka: --version ვერსიის ინფორმაციის გამოტანა და გასვლა

source: Options:
ka: პარამეტრები

source: -i, --index=NUMBER match index of image (first is 1)
ka: -i, --index=NUMBER გამოსახულების ინდექსის დამთხვევა (პირველი არის 1)

source: -w, --width=PIXELS match width of image
ka: -w, --width=PIXELS გამოსახულების სიგანის დამთხვევა

source: -h, --height=PIXELS match height of image
ka: -h, --height=PIXELS გამოსახულების სიმაღლის დამთხვევა

source: -p, --palette-size=COUNT match number of colors in palette (or 0)
ka: -p, --palette-size=COUNT პალიტრაში ფერების რაოდენობის დამთხვევა (ან 0)

source: -b, --bit-depth=COUNT match or set number of bits per pixel
ka: -b, --bit-depth=COUNT ბიტების რაოდენობის დამთხვევა ან დაყენება თითოეული პიქსელისთვის

source: -X, --hotspot-x=COORD match or set cursor hotspot x-coordinate
ka: -X, --hotspot-x=COORD კურსორის hotspot x-coordinate-ის დაყენება, ან დამთხვევა

source: -Y, --hotspot-y=COORD match or set cursor hotspot y-coordinate
ka: -Y, --hotspot-y=COORD კურსორის hotspot y-coordinate-ის დამთხვევა, ან დაყენება

source: -t, --alpha-threshold=LEVEL highest level in alpha channel indicating transparent image portions (default is 127)
ka: -t, --alpha-threshold=LEVEL უმაღლესი დონე ალფა არხის, რომელიც მიუთითებს გამოსახულების გამჭვირვალე ნაწილებზე (ნაგულისხმევია 127)

source: -r, --raw=FILENAME store input file as raw PNG ("Vista icons")
ka: -r, --raw=FILENAME შეყვანილი ფაილის შენახვა დაუმუშავებელი PNG ფაილის სახით ("Vista-ის ხატულები")

source: --icon match icons only
ka: --icon მხოლოდ ხატულების დამთხვევა

source: --cursor match cursors only
ka: --cursor მხოლოდ კურსორების დამთხვევა

source: -o, --output=PATH where to place extracted files
ka: -o, --output=ბილიკი სად მოთავსდება ამოღებული ფაილები

source: Report bugs to <%s>.
ka: შეცდომების შესახებ მიწერეთ: <%s>

source: %s: cannot set locale: %s
ka: %s: ვერ დავაყენე ლოკალი: %s

source: %s: bindtextdomain failed: %s
ka: %s: bindtextdomain ჩავარდა: %s

source: %s: cannot set message domain: %s
ka: %s: შეტყობინების დომენის დაყენება შეუძლებელია: %s

source: invalid index value: %s
ka: არასწორი ინდექსის მნიშვნელობა: %s

source: invalid width value: %s
ka: არასწორი სიგანის მნიშვნელობა: %s

source: invalid height value: %s
ka: არასწორი სიმაღლის მნიშვნელობა: %s

source: invalid palette-size value: %s
ka: არასწორი პალიტრის ზომის მნიშვნელობა: %s

source: invalid bit-depth value: %s
ka: არასწორი ბიტების სიღრმის მნიშვნელობა: %s

source: invalid hotspot-x value: %s
ka: hotspot-x-ის არასწორი მნიშვნელობა: %s

source: invalid hotspot-y value: %s
ka: hotspot-y-ის არასწორი მნიშვნელობა: %s

source: invalid alpha-threshold value: %s
ka: არასწორი ალფას ზღვრის მნიშვნელობა: %s

source: multiple commands specified
ka: მითითებულია ერთზე მეტი ბრძანება

source: missing argument
ka: ნაკლული არგუმენტი

source: only one of --icon and --cursor may be specified
ka: შეგიძლიათ მიუთითოთ, მხოლოდ, ერთ-ერთი პარამეტრებიდან --icon და --cursor

source: missing file argument
ka: აკლია ფაილის არგუმენტი

source: missing arguments
ka: აკლია არგუმენტები

source: %s: no images matched
ka: %s: გამოსახულება არ დამთხვეულა

source: %s: No bit-depth given
ka: %s: ბიტური სიღრმე მითითებული არაა

source: %s: don't know how to extract resource, try `--raw'
ka: %s: არ ვიცი, რესურსი როგორ ამოვიღო. სცადეთ `--raw'

source: %s: could not find `%s' in `%s' resource.
ka: %s: ვერ ვიპოვე `%s' `%s' რესურსში.

source: %s: icon resource `%s' is empty, skipping
ka: %s: ხატულას რესურსი `%s' ცარიელია. გამოტოვება

source: %s: mismatch of size in icon resource `%s' and group (%zu vs %zu)
ka: %s: ხატულას რესურსის `%s' და ჯგუფის ზომები არ ემთხვევა (%zu და %zu)

source: %s: icon resource `%s' is corrupted, skipping
ka: %s: ხატულას რესურსი `%s' დაზიანებულია. გამოტოვება

source: %s: premature end
ka: %s: მოულოდნელი დასასრული

source: Extract resources from Microsoft Windows(R) binaries.
ka: რესურსების ამოღება Microsoft Windows(R)-ის ბინარული ფაილებიდან.

source: -x, --extract extract resources
ka: -x, --extract რესურსების ამოღება

source: -l, --list output list of resources (default)
ka: -l, --list რესურსების სიის გამოტანა (ნაგულისხმევი)

source: Filters:
ka: ფილტრები:

source: -t, --type=[+|-]ID resource type identifier
ka: -t, --type=[+|-]ID რესურსის ტიპის იდენტიფიკატორი

source: -n, --name=[+|-]ID resource name identifier
ka: -n, --name=[+|-]ID რესურსის სახელის იდენტიფიკატორი

source: -L, --language=[+|-]ID resource language identifier
ka: -L, --language=[+|-]ID რესურსის ენის იდენტიფიკატორი

source: -a, --all perform operation on all resource (default)
ka: -a, --all ოპერაციის ჩატარება ყველა რესურსზე (ნაგულისხმევი)

source: Miscellaneous:
ka: სხვადასხვა:

source: -o, --output=PATH where to place extracted files
ka: -o, --output=ბილიკი სად მოთავსდება ამოღებული ფაილები

source: -R, --raw do not parse resource contents
ka: -R, --raw რესურსის შემცველობა არ დამუშავდება

source: -v, --verbose explain what is being done
ka: -v, --verbose ახნა, რა ხდება

source: --help display this help and exit
ka: --help ამ დახმარების გამოტანა და გასვლა

source: --version output version information and exit
ka: --version ვერსიის ინფორმაციის გამოტანა და გასვლა

source: A leading `+' in --type, name or language options indicates a true string identifier. Similarly, `-' indicates a true numeric identifier.
ka: პარამეტრში --type, სახელის, ან ენის პარამეტრების '+' სიმბოლოთი დაწყება მიუთითებს ნამდვილი სტრიქონის იდენტიფიკატორზე. მსგავსად, `-' ნამდვილ რიცხვით იდენტიფიკატორს ნიშნავს.

source: Report bugs to %s.
ka: შეცდომების შესახებ მიწერეთ: %s

source: --language has no effect without --name and --type
ka: პარამეტრს --language აზრი არ აქვს --name და --type პარამეტრების გარეშე

source: --name has no effect without --type
ka: პარამეტრს --name აზრი არ აქვს პარამეტრის --type გარეშე

source: missing file argument Try `%s --help' for more information.
ka: აკლია ფაილის არგუმენტი მეტი ინფორმაციისთვის სცადეთ '%s --help'.

source: %s: file has a size of 0
ka: %s: ფაილის ზომა ნულია

source: %s: --language has no effect because file is 16-bit binary
ka: %s: პარამეტრს --language აზრი არ აქვს, რადგან ფაილი 16-ბიტიანი ბინარული ფაილია

source: %s: resource structure malformed
ka: %s: რესურსის სტრუქტურა არასწორია

source: %s: resource table invalid, ignoring remaining entries
ka: %s: რესურსების ცხრილი არასწორია. დარჩენილი ჩანაწერების გამოტოვება

source: %s: not a PE or NE library
ka: %s: არ წარმოადგენს არც PE, არც NE ბიბლიოთეკას

source: %s: no resource directory found
ka: %s: რესურსების საქაღალდე აღმოჩენილი არაა

source: %s: invalid sections layout
ka: %s: არასწორი სექციების განლაგება

source: %s: file contains no resources
ka: %s: ფაილი რესურსებს არ შეიცავს
